# LDevice_SetAccPos3D

## Description
Set the 3D position and rotation of the specified accessory.

```pascal
PROCEDURE LDevice_SetAccPos3D(
				handle         : HANDLE;
				cellIndex      : LONGINT;
				accessoryIndex : LONGINT;
				position3D     : REAL;
				rotationX      : REAL;
				rotationY      : REAL;
				rotationZ      : REAL);
```

```python

def vs.LDevice_SetAccPos3D(handle, cellIndex, accessoryIndex, position3D, rotationX, rotationY, rotationZ):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|handle|HANDLE||
|cellIndex|LONGINT||
|accessoryIndex|LONGINT||
|position3D|REAL||
|rotationX|REAL||
|rotationY|REAL||
|rotationZ|REAL||

## Version
Availability: from Vectorworks 2021
## Category
* Spotlight